import React from 'react';
import styles from './TermsOfService.module.scss';

const TermsOfService: React.FC = () => {
    return (
        <div className={styles.termsOfService}>
            <h1>Пользовательское соглашение</h1>
            <p>
                Настоящее Пользовательское соглашение (далее – «Соглашение») регулирует использование веб-сайта [вставьте URL сайта] (далее – «Сайт») и его услуг. Перед использованием Сайта и его сервисов, пожалуйста, внимательно ознакомьтесь с данным Соглашением. Использование Сайта означает ваше согласие с условиями настоящего Соглашения.
            </p>

            <h2>1. Общие положения</h2>
            <p>1.1. Сайт предоставляет Пользователю доступ к различным услугам, включая, но не ограничиваясь, информационными материалами, сервисами, продуктами, предоставляемыми через Сайт (далее – «Услуги»).</p>
            <p>1.2. В случае несогласия с настоящим Соглашением, Пользователь обязан немедленно прекратить использование Сайта и его Услуг.</p>

            <h2>2. Право на использование Сайта</h2>
            <p>2.1. Пользователь подтверждает, что имеет право на использование Сайта и Услуг согласно законодательству Российской Федерации.</p>
            <p>2.2. Сайт предоставляет Пользователю ограниченное, неисключительное право на доступ и использование Услуг в рамках настоящего Соглашения.</p>

            <h2>3. Права и обязанности Сайта</h2>
            <p>3.1. Сайт обязуется:</p>
            <ul>
                <li>Обеспечивать доступ Пользователей к Услугам, предоставляемым через Сайт;</li>
                <li>Осуществлять защиту персональных данных Пользователей в соответствии с Политикой конфиденциальности;</li>
                <li>Предоставлять информацию о Сайте и Услугах, а также уведомлять Пользователей о возможных изменениях.</li>
            </ul>
            <p>3.2. Сайт имеет право:</p>
            <ul>
                <li>В любой момент изменять, приостанавливать или прекращать предоставление Услуг без предварительного уведомления Пользователей;</li>
                <li>Изменять условия Соглашения без предварительного уведомления, размещая обновленную версию на Сайте.</li>
            </ul>

            <h2>4. Права и обязанности Пользователя</h2>
            <p>4.1. Пользователь обязуется:</p>
            <ul>
                <li>Использовать Сайт и Услуги только в законных целях, не нарушая законодательства Российской Федерации;</li>
                <li>Соблюдать условия данного Соглашения и другие положения, касающиеся использования Сайта и Услуг;</li>
                <li>Не вмешиваться в работу Сайта и не пытаться получить несанкционированный доступ к его системам.</li>
            </ul>
            <p>4.2. Пользователь имеет право:</p>
            <ul>
                <li>Получать доступ к Услугам, предоставляемым через Сайт;</li>
                <li>В любое время прекратить использование Сайта и его Услуг.</li>
            </ul>

            <h2>5. Интеллектуальная собственность</h2>
            <p>5.1. Все материалы, размещенные на Сайте, включая текстовые, графические, аудиовизуальные элементы, логотипы, изображения, программное обеспечение и другие объекты интеллектуальной собственности, защищены законодательством Российской Федерации и принадлежат Сайту или его лицензиарам.</p>
            <p>5.2. Пользователю запрещается копировать, распространять, изменять, передавать или использовать эти материалы без письменного согласия правообладателя.</p>

            <h2>6. Персональные данные</h2>
            <p>6.1. Обработка персональных данных Пользователей осуществляется в соответствии с Политикой конфиденциальности, размещенной на Сайте.</p>
            <p>6.2. Пользователь предоставляет свои персональные данные с учетом их обработки и использования в целях, указанных в Политике конфиденциальности.</p>

            <h2>7. Ответственность сторон</h2>
            <p>7.1. Сайт не несет ответственности за:</p>
            <ul>
                <li>Прямые или косвенные убытки, возникшие в связи с использованием Сайта и Услуг;</li>
                <li>Невозможность доступа к Сайту или Услугам по причине технических проблем, действий третьих лиц или других обстоятельств.</li>
            </ul>
            <p>7.2. Пользователь несет ответственность за нарушение условий Соглашения, а также за последствия использования Сайта и Услуг в нарушение законодательства.</p>

            <h2>8. Изменения в Соглашении</h2>
            <p>8.1. Сайт оставляет за собой право в любое время изменять условия настоящего Соглашения. Все изменения вступают в силу с момента их публикации на Сайте.</p>
            <p>8.2. Пользователь обязуется регулярно проверять условия Соглашения на предмет изменений. Продолжение использования Сайта после изменения условий Соглашения означает согласие с новыми условиями.</p>

            <h2>9. Заключительные положения</h2>
            <p>9.1. Настоящее Соглашение регулируется законодательством Российской Федерации.</p>
            <p>9.2. Все споры, возникающие из настоящего Соглашения, подлежат рассмотрению в суде по месту нахождения Сайта.</p>
            <p>9.3. Если какое-либо из положений Соглашения признано недействительным или незаконным, это не влияет на действительность остальных положений Соглашения.</p>

            <h2>10. Контактная информация</h2>
            <p>Если у вас возникли вопросы или предложения относительно настоящего Соглашения, пожалуйста, свяжитесь с нами:</p>
            <ul>
                <li>Email: info@transagro.group</li>
                <li>Адрес: Респ. Калмыкия, г. Элиста, ул. им. Чкалова, д. 36</li>
            </ul>
        </div>
    );
};

export default TermsOfService;
